---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomHeight
source: html/8bc472d9-a221-71b5-d16e-fe8c9a79682e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomHeight Property

"Unbounded Height"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomHeight { get; }
```